Revit 2027 API
EnergyAnalysisZone.HeatingSetPoint Property
 The heating temperature set point in unit Kelvin (K).
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double HeatingSetPoint { get; }
Public ReadOnly Property HeatingSetPoint As Double
	Get
public:
property double HeatingSetPoint {
	double get ();
}
member HeatingSetPoint : float with get
Property Value
Double
See Also
Reference
EnergyAnalysisZone Class
Autodesk.Revit.DB.Analysis Namespace